# Brewfile by Caiobep

# Setting up cask dir
cask_args appdir:'/Applications'

# Homebrew Bundle
tap 'homebrew/bundle'

## caskroom/cask
tap 'caskroom/cask'
brew 'brew-cask'

## homebrew/binary
tap 'homebrew/binary'

## homebrew/boneyard
tap 'homebrew/boneyard'
brew 'googlecl'

# Updating native GNU core
brew 'coreutils'

# Aditional Tools
brew 'moreutils'

# Find/Locate to macOS
brew 'findutils'

# --- Apps and Tools ---
# Development
brew 'ack'
brew 'android-plataform-tools'
brew 'bash'
brew 'bash-completion2'
brew 'docker'
brew 'gdrive'
brew 'git'
brew 'go'
brew 'grc'
brew 'jp2a'
brew 'jq'
brew 'libcaca', args: ['with-imlib2']
brew 'libgit2'
brew 'm-cli'
brew 'mysql'
brew 'node'
brew 'openssl'
brew 'postgresql'
brew 'python'
brew 'readline'
brew 'ruby-build'
brew 'rbenv'
brew 'roundup'
brew 'spaceman-diff'
brew 'spark'
brew 'tmux'
brew 'unrar'
brew 'wget'
brew 'yarn'

# Tools
brew 'nmap'
brew 'speedtest_cli'
brew 'youtube-dl'

# Essential Every-day apps
cask 'alfred'
cask 'atom'
cask 'macvim'
cask 'slack'
cask 'transmission'
cask 'tunnelbear'
cask 'virtualbox'
cask 'vlc'
cask 'java'
# cask 'visual-studio'
# cask 'android-studio'

# Google Slavery
cask 'google-chrome'
cask 'google-drive'
cask 'google-photos-backup'
cask 'chromecast'

# Personal Productivity apps
cask 'dropbox'
cask '1password'
cask 'bartender'
cask 'icons8'
cask 'keepingyouawake'
cask 'spectacle'

# Others
cask 'spotify'
cask 'spotify-notifications'
cask 'openemu'
cask 'remote-play'
cask 'whatsapp'

# CTF tools
brew 'aircrack'
brew 'bfg'
brew 'binutils'
brew 'binwalk'
brew 'cifer'
brew 'dex2jar'
brew 'dns2tcp'
brew 'fcrackzip'
brew 'foremost'
brew 'hashpump'
brew 'hydra'
brew 'john'
brew 'knock'
brew 'netpbm'
brew 'nmap'
brew 'pngcheck'
brew 'socat'
brew 'sqlmap'
brew 'tcpflow'
brew 'tcpreplay'
brew 'tcptrace'
brew 'ucspi-tcp'
brew 'xpdf'
brew 'xz'
cask 'torbrowser'

# => AppStore Apps
brew 'mas'
mas '1176895641' # Spark
mas '715768417' # Microsoft Remote Desktop
mas '568494494'  # pocket
mas '410628904'  # wunderlist
mas '409183694'  # keynote
mas '497799835'  # xcode
