tap "microsoft/mssql-release"
tap "homebrew/fuse"
tap "homebrew/core"
tap "homebrew/versions"
tap "homebrew/binary"
tap "homebrew/boneyard"
tap "homebrew/python"
tap "homebrew/bundle"
tap "homebrew/services"
tap "caskroom/fonts"
tap "caskroom/cask"
tap "aspnet/k"
cask "java"
brew "ack"
brew "openssl"
brew "aircrack-ng"
brew "android-platform-tools", link: false
brew "asciiquarium"
brew "autoconf"
brew "bash"
brew "bash-completion"
brew "bfg"
brew "binutils"
brew "isl"
brew "mpfr"
brew "gcc"
brew "p7zip"
brew "ssdeep"
brew "binwalk"
brew "cask"
brew "cifer"
brew "cmatrix"
brew "coreutils"
brew "cowsay"
brew "dex2jar"
brew "dns2tcp"
brew "git"
brew "docker", link: false
brew "docker-machine"
brew "docker-compose"
brew "docker-machine-driver-xhyve"
brew "elvish", args: ["HEAD"]
brew "emojify"
brew "ettercap"
brew "fcrackzip"
brew "figlet"
brew "findutils"
brew "foremost"
brew "fortune"
brew "freetype"
brew "gdbm"
brew "gdrive"
brew "geoip"
brew "go"
brew "grc"
brew "hashpump"
brew "haskell-stack"
brew "highlight"
brew "htop"
brew "hydra"
brew "libtool"
brew "imagemagick"
brew "john"
brew "jp2a"
brew "oniguruma"
brew "jq"
brew "knock"
brew "kotlin"
brew "libdnet"
brew "libevent"
brew "libssh2"
brew "libgit2"
brew "m-cli"
brew "mas"
brew "python", link: false
brew "mercurial"
brew "mongodb"
brew "moreutils"
brew "subversion"
brew "netpbm"
brew "nmap"
brew "node"
brew "nvm"
brew "nyancat"
brew "packer"
brew "packer-completion"
brew "pandoc"
brew "pidof"
brew "pkg-config"
brew "pngcheck"
brew "postgresql", restart_service: true
brew "ruby-build"
brew "rbenv"
brew "redis"
brew "rename"
brew "rig"
brew "roundup"
brew "ruby@2.1"
brew "shpotify"
brew "sl"
brew "socat"
brew "spaceman-diff"
brew "spark"
brew "speedtest-cli"
brew "sqlmap"
brew "subversion"
brew "tcpflow"
brew "tcpreplay"
brew "tcptrace"
brew "tmux"
brew "ucspi-tcp"
brew "unrar"
brew "vagrant-completion"
brew "wget"
brew "wireshark", args: ["with-qt"], link: false
brew "xhyve"
brew "youtube-dl"
brew "zeromq"
cask "1password"
cask "alfred"
cask "android-sdk"
cask "atom"
cask "bartender"
cask "betterzipql"
cask "colorsnapper"
cask "dashlane"
cask "docker"
cask "dotnet"
cask "dotnet-sdk"
cask "dropbox"
cask "duet"
cask "fog"
cask "franz"
cask "google-chrome"
cask "google-drive"
cask "google-photos-backup"
cask "grammarly"
cask "hyper"
cask "icons8"
cask "keepingyouawake"
cask "kitematic"
cask "lumen"
cask "macvim"
cask "mono-mdk"
cask "openemu"
cask "opera"
cask "qlcolorcode"
cask "qlimagesize"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "remote-play"
cask "sequel-pro"
cask "sip"
cask "slack"
cask "spectacle"
cask "spotify"
cask "spotify-notifications"
cask "sqlpro-for-mssql"
cask "suspicious-package"
cask "teamviewer-quickjoin"
cask "teamviewer-quicksupport"
cask "torbrowser"
cask "transmission"
cask "tripmode"
cask "tunnelbear"
cask "upterm"
cask "vagrant"
cask "virtualbox"
cask "virtualbox-extension-pack"
cask "visual-studio"
cask "visual-studio-code"
cask "vlc"
cask "vysor"
cask "webpack-dashboard"
cask "webpquicklook"
cask "whale"
cask "whatsapp"
cask "zeplin"
mas "Amphetamine", id: 937984704
mas "GIPHY CAPTURE", id: 668208984
mas "Keynote", id: 409183694
mas "Pocket", id: 568494494
mas "Skitch", id: 425955336
mas "Spark", id: 1176895641
mas "Todoist", id: 585829637
mas "Trello", id: 1278508951
